// •	Какое будет выведено значение:
let x = 5;
console.log( x++ ); // 5

// •	Чему равно такое выражение:
console.log([ ] + false - null + true);  //NaN

// •	Что выведет этот код:
let y = 1;
let x = y = 2;
console.log (x); //2

// •	Чему равна сумма:
 console.log([ ] + 1 + 2); //12

// •	Что выведет этот код:
console.log( "1"[0] ); //1

// •	Чему равно:
 console.log(2 && 1 &&null&& 0 &&undefined); //null

// •	Есть ли разница между выражениями?
console.log (!!( a && b ) (a && b));

// •	Что выведет этот код:
 alert( null || 2 && 3 || 4 );

// •	a = [1, 2, 3]; b = [1, 2, 3];
 Правда ли что a == b ?

// •	Что выведет этот код:
 alert( +"Infinity" );

// •	Верно ли сравнение:
 "Ёжик" > "яблоко"?

// •	Чему равно:
0 || "" || 2 || undefined || true || falsе 

